## Index Alignment

In [1]:
import pandas as pd
import numpy as np

In [11]:
A = pd.DataFrame(np.random.randint(0,5,(2,2)),columns=['A','B'])
A

   A  B
0  3  3
1  4  2

In [12]:
B = pd.DataFrame(np.random.randint(0,5,(3,3)),columns=['B','A','C'])
B

   B  A  C
0  0  2  3
1  1  2  1
2  4  1  0

In [13]:
A + B

     A    B   C
0  5.0  3.0 NaN
1  6.0  3.0 NaN
2  NaN  NaN NaN

## Operations between Dataframes and Series

In [14]:
rng = np.random

In [15]:
A = rng.randint(10,size=(3,4))
A

array([[1, 4, 3, 9],
       [4, 3, 4, 3],
       [8, 1, 3, 1]])

In [16]:
A - A[0]

array([[ 0,  0,  0,  0],
       [ 3, -1,  1, -6],
       [ 7, -3,  0, -8]])

In [17]:
df = pd.DataFrame(A, columns=list('QRST'))
df

   Q  R  S  T
0  1  4  3  9
1  4  3  4  3
2  8  1  3  1

In [21]:
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1  3 -1  1 -6
2  7 -3  0 -8

In [22]:
df.subtract(df['R'],axis=0)

   Q  R  S  T
0 -3  0 -1  5
1  1  0  1  0
2  7  0  2  0

DataFrame.add 
- *Add DataFrames.*

DataFrame.sub
- *Subtract DataFrames.*

DataFrame.mul
- *Multiply DataFrames.*

*DataFrame.div*
- Divide DataFrames (float division).

*DataFrame.truediv*
- Divide DataFrames (float division).

*DataFrame.floordiv*
- Divide DataFrames (integer division).

*DataFrame.mod*
- Calculate modulo (remainder after division).

*DataFrame.pow*
- Calculate exponential power.

### Exercício

Escreva uma função para normalizar um DataFrame do pandas df subtraindo os valores da primeira linha de todas as outras linhas e dividindo todos os valores pelo maior elemento do dataframe.

In [38]:
A = pd.DataFrame(np.random.randint(0,5,(4,3)),columns=['B','A','C'])
A

   B  A  C
0  0  4  4
1  1  4  1
2  1  2  3
3  3  0  4

In [39]:
first_row = A.iloc[0]
first_row

B    0
A    4
C    4
Name: 0, dtype: int32

In [40]:
A = A - first_row
A

   B  A  C
0  0  0  0
1  1  0 -3
2  1 -2 -1
3  3 -4  0

In [41]:
max_value = A.max().max()
max_value

3

In [42]:
A = A.divide(max_value)
A

          B         A         C
0  0.000000  0.000000  0.000000
1  0.333333  0.000000 -1.000000
2  0.333333 -0.666667 -0.333333
3  1.000000 -1.333333  0.000000

In [43]:
def normalize(df):
    first_row = df.iloc[0]
    df = df - first_row
    max_value = df.max().max()
    df = df.divide(max_value)
    return df

In [46]:
novo1 = pd.DataFrame(np.random.randint(0,5,(8,2)),columns=['B','A'])

In [47]:
normalize(novo1)

      B     A
0  0.00  0.00
1  0.25  0.75
2  1.00  0.00
3  0.50  0.25
4  0.75  1.00
5  0.25  1.00
6  1.00  0.50
7  0.25  0.25

## Missing Values

In [48]:
df = pd.DataFrame([[1, np.nan, 2],
                   [2,3,4],
                   [None,4,5]])

In [49]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  4
2  NaN  4.0  5

In [50]:
df.dropna()

     0    1  2
1  2.0  3.0  4

In [51]:
df.dropna(axis='columns')

   2
0  2
1  4
2  5

In [52]:
df.isna()

       0      1      2
0  False   True  False
1  False  False  False
2   True  False  False

In [54]:
df.isna().sum().sum()

2

In [56]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  4 NaN
2  NaN  4.0  5 NaN

In [57]:
df.dropna(axis='rows',thresh=3)

     0    1  2   3
1  2.0  3.0  4 NaN

In [58]:
df.fillna(0)

     0    1  2    3
0  1.0  0.0  2  0.0
1  2.0  3.0  4  0.0
2  0.0  4.0  5  0.0

In [59]:
df.fillna(df.mean().mean())

          0         1  2         3
0  1.000000  2.888889  2  2.888889
1  2.000000  3.000000  4  2.888889
2  2.888889  4.000000  5  2.888889

In [61]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  4 NaN
2  NaN  4.0  5 NaN

In [60]:
df.fillna(method='ffill') #forwardfill

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  4 NaN
2  2.0  4.0  5 NaN

In [62]:
df.fillna(method='bfill') #backward fill

     0    1  2   3
0  1.0  3.0  2 NaN
1  2.0  3.0  4 NaN
2  NaN  4.0  5 NaN

In [64]:
df.fillna(method='ffill',axis='columns').fillna(method='ffill') #forwardfill

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  4.0  4.0
2  2.0  4.0  5.0  5.0

### Exercício

Considere o seguinte dataframe

In [78]:
df = pd.DataFrame({'A': [1, 2, np.nan, 4, 5],
                   'B': [6, np.nan, 8, 9, 10],
                   'C': [11, 12, 13, np.nan, 15],
                   'D': [16, 17, 18, 19, np.nan]})
df

     A     B     C     D
0  1.0   6.0  11.0  16.0
1  2.0   NaN  12.0  17.0
2  NaN   8.0  13.0  18.0
3  4.0   9.0   NaN  19.0
4  5.0  10.0  15.0   NaN

1. Identifique quantos valores faltantes há em cada coluna do DataFrame.
2. Substitua os valores faltantes por 0.
3. Substitua os valores faltantes pela média da coluna.

In [79]:
df.isna().sum()

A    1
B    1
C    1
D    1
dtype: int64

In [80]:
df.fillna(0, inplace=False)

     A     B     C     D
0  1.0   6.0  11.0  16.0
1  2.0   0.0  12.0  17.0
2  0.0   8.0  13.0  18.0
3  4.0   9.0   0.0  19.0
4  5.0  10.0  15.0   0.0

In [81]:
df

     A     B     C     D
0  1.0   6.0  11.0  16.0
1  2.0   NaN  12.0  17.0
2  NaN   8.0  13.0  18.0
3  4.0   9.0   NaN  19.0
4  5.0  10.0  15.0   NaN

In [82]:
df.mean()

A     3.00
B     8.25
C    12.75
D    17.50
dtype: float64

In [83]:
df.fillna(df.mean(),inplace=True)

In [84]:
df

     A      B      C     D
0  1.0   6.00  11.00  16.0
1  2.0   8.25  12.00  17.0
2  3.0   8.00  13.00  18.0
3  4.0   9.00  12.75  19.0
4  5.0  10.00  15.00  17.5